In [1]:
import psycopg2
from psycopg2 import OperationalError
import pandas as pd
import numpy as np

In [2]:
def create_connection(db_name,db_user,db_password,db_host,db_port):
    connection = None
    try:
        connection = psycopg2.connect(
            database = db_name,
            user = db_user,
            password = db_password,
            host = db_host,
            port = db_port,
        )
        cursor = connection.cursor()
        print("YaY")
    except OperationalError as error: 
        print(f"Nope '{error}'")
    return connection

In [3]:
from config import name, user, password, host, port

In [4]:
connection = create_connection(name, user, password, host, port)

YaY

In [5]:
with connection:
    with connection.cursor() as cursor:
        cursor.execute("""
                       SELECT year, value, countries.name, countries.latitude, countries.longitude, flows.name, products.name 
                           FROM quantities 
                               JOIN countries 
                                   ON quantities.country_id = countries.id 
                               JOIN flows 
                                   ON quantities.flow_id = flows.id
                               JOIN products 
                                   ON products.id = quantities.product_id;
                       """)
        table = cursor.fetchall()

In [6]:
line = {
        'years' : None,
        'values' : None,
        'countries' : None,
        'latitudes' : None,
        'longitudes' : None,
        'flows' : None,
        'products' : None
    }

In [7]:
test = []
for element in table:
    line = {
        'years' : element[0],
        'values' : element[1],
        'countries' : element[2],
        'latitudes' : element[3],
        'longitudes' : element[4],
        'flows' : element[5],
        'products' : element[6]
    }
    test.append(line)
pd.DataFrame(test)

,years,values,countries,latitudes,longitudes,flows,products
0,1971,32680,Australia,-24.7761086,134.755,Production (ktoe),"Coal, peat and oil shale"
1,1972,39372,Australia,-24.7761086,134.755,Production (ktoe),"Coal, peat and oil shale"
2,1973,40251,Australia,-24.7761086,134.755,Production (ktoe),"Coal, peat and oil shale"
3,1974,39179,Australia,-24.7761086,134.755,Production (ktoe),"Coal, peat and oil shale"
4,1975,44767,Australia,-24.7761086,134.755,Production (ktoe),"Coal, peat and oil shale"
...,...,...,...,...,...,...,...
290299,2014,23844432,World,25.2528888,55.17696777178696,Electricity output (GWh),Total
290300,2015,24280352,World,25.2528888,55.17696777178696,Electricity output (GWh),Total
290301,2016,24967736,World,25.2528888,55.17696777178696,Electricity output (GWh),Total
290302,2017,25612005,World,25.2528888,55.17696777178696,Electricity output (GWh),Total
290303,2018,26618881,World,25.2528888,55.17696777178696,Electricity output (GWh),Total

In [13]:
with connection:
    with connection.cursor() as cursor:
        cursor.execute("""
                       SELECT countries.name, year, value
                           FROM quantities 
                           JOIN countries 
                               ON quantities.country_id = countries.id
                           WHERE name = 'Australia';
                       """)
        australia = cursor.fetchall()
pd.DataFrame(australia)

              0     1       2
0     Australia  1971   32680
1     Australia  1972   39372
2     Australia  1973   40251
3     Australia  1974   39179
4     Australia  1975   44767
...         ...   ...     ...
5371  Australia  2014  247368
5372  Australia  2015  251294
5373  Australia  2016  256266
5374  Australia  2017  257771
5375  Australia  2018  260808

[5376 rows x 3 columns]